## PANDAS

* Pandas is an open source library built on top of numpy. 
* It allows fast ananlysis of data. It can work with data wide variety of sources.
* It also has built-in visualization features.

In [1]:
# import libraries

import numpy as np
import pandas as pd

### Series is same as Numpy array but we can label the index

* Create series using array
* Create series using list with default index
* Create series using dictionary
* Series can contain data with any datatype

In [2]:
# create an array
my_arr = np.array([1, 2, 3, 4])
my_arr

array([1, 2, 3, 4])

In [3]:
# create an array of labels
my_labels = np.array(['a', 'b', 'c', 'd'])
my_labels

array(['a', 'b', 'c', 'd'], dtype='<U1')

In [4]:
# create series
my_series = pd.Series(my_arr, my_labels)
my_series

a    1
b    2
c    3
d    4
dtype: int32

In [5]:
# default index will be 0, 1, 2.... and we can also pass a list
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [6]:
# create a dictionary
my_dict = {'p': 10, 'q': 20, 'r': 30}
my_dict

{'p': 10, 'q': 20, 'r': 30}

In [7]:
# create series using dictionary - keys will be index
pd.Series(my_dict)

p    10
q    20
r    30
dtype: int64

In [8]:
# series can hold any data type
pd.Series([1, 'c', sum])

0                          1
1                          c
2    <built-in function sum>
dtype: object

### Adding two series

* If common index is found then values will be added otherwise nan is displayed

In [9]:
# create series1
series1 = pd.Series([1, 2, 3, 4], ['A', 'B', 'C', 'D'])
series1

A    1
B    2
C    3
D    4
dtype: int64

In [10]:
# create series2
series2 = pd.Series([1, 2, 4, 5], ['A', 'B', 'D', 'E'])
series2

A    1
B    2
D    4
E    5
dtype: int64

In [11]:
# add
series1 + series2 # index C and E are not common to both series and therefore nan

A    2.0
B    4.0
C    NaN
D    8.0
E    NaN
dtype: float64

### DataFrame is a bunch of series that share same index

* Create DataFrame
* Add new column
* Drop new column
* DataFrame shape
* Access rows, columns, elements and subset of DataFrame

In [12]:
# import randn
from numpy.random import randn

# to get same random number every time based on seed value
np.random.seed(101)

In [13]:
# create dataframe
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z']) # pd.DataFrame(data, rows, cols)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
# what does a dataFrame contain - a Series
type(df['W'])

pandas.core.series.Series

In [15]:
# add new column to existing df
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [16]:
# drop existing column
df.drop('new', axis = 1) # by default axis=0, that checks for rows. If we want to give col names then axis = 1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
# but 'new' column is still existing in df after dropping
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [18]:
# Pandas make sure that we do not lose any data accidentally. If we want to drop any columns/rows from a df then we've to provide inplace=true.
df.drop('new', axis=1, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
# shape of df
df.shape # rows x columns

(5, 4)

In [20]:
# access df columns
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [21]:
# access df rows
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [22]:
# access df rows by its position
df.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [23]:
# get elements of df (col, row)
df['W']['A']

2.706849839399938

In [24]:
# get elements of df (row, col)
df.loc['A']['W']

2.706849839399938

In [25]:
# subset of df
df.loc[['A', 'B'], ['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

### DataFrame comparison

* Comparing df with a scalar creates a boolean df
* Passing the boolean df to original df filters only required elements (others: nan)
* Can be compared by particular columns

In [26]:
# Dataframe
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
# create a boolean df that staisfies the condition df elements greater than zero
boolean_df = df > 0
boolean_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [28]:
# get elements greater than zero - boolean false = nan
df_greater_0 = df[boolean_df]
df_greater_0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
# get elements where of column 'Y' > 1
df[df['Y'] > 1]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [30]:
# multiple conditions
df[(df['W'] > 0) & (df['X'] > 1)] 
# df[(df['W'] > 0) and (df['X'] > 1)] -> this gives error because 'and' can compare only 2 boolean values, not a series of them. We've to use '&'

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

### DataFrame Index reset

* Index will be reset to 0, 1, 2..... 
* Previous index becomes a new column
* Set index to a particular column. Unlike reset, this will overwrite the index
* If we want to set index to a particular list then that list has to be added as a column first

In [31]:
new_df = df.reset_index()
new_df # previous index A, B, C... has become a new column 'index'

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [32]:
# index is changed
new_df['W']

0    2.706850
1    0.651118
2   -2.018168
3    0.188695
4    0.190794
Name: W, dtype: float64

In [34]:
# add a new column to df
new_index = 'CA NY WY OR CO'.split() # instead of writing many quotes to create a list, this is a quick way.
df['States'] = new_index
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [35]:
# set index to a particular column
df.set_index('States') # unlike df_reset(), this will overwrite the index

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### Grouping DataFrame

* Create two lists for two index (outside and inside) of dataframe
* Combine lists to create a tuple
* Create multiindex using the tuple
* Create a dataframe using the multiindex
* Name the index
* Fetch elements

In [36]:
# create an outside list
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [37]:
# create an outside list
inside = [1, 2, 3, 1, 2, 3]
inside

[1, 2, 3, 1, 2, 3]

In [38]:
# create a tuple by combining two lists
heir_index = list(zip(outside, inside)) # zip combines 2 lists into a tuple
heir_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [39]:
# create a multiindex using tupple
heir_index = pd.MultiIndex.from_tuples(heir_index)
heir_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [40]:
# create a dataframe with multiindex
df = pd.DataFrame(randn(6, 2), heir_index, ['A', 'B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [41]:
# name the index
df.index.names = ['Groups', 'Numbers']
df

                       A         B
Groups Numbers
G1     1        0.302665  1.693723
       2       -1.706086 -1.159119
       3       -0.134841  0.390528
G2     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646

In [42]:
# get elements of G1
df.loc['G1']

                A         B
Numbers
1        0.302665  1.693723
2       -1.706086 -1.159119
3       -0.134841  0.390528

In [43]:
# to fetch a particular element
df.loc['G1'].loc[2]['B']

-1.1591194155484297

### Cross section

* df.loc cannot directly access inner elements of a dataframe
* Cross section can be used to directly fetch any element of a dataframe

In [44]:
df

                       A         B
Groups Numbers
G1     1        0.302665  1.693723
       2       -1.706086 -1.159119
       3       -0.134841  0.390528
G2     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646

In [45]:
# get elements of index Numbers = 1
df.xs(1, level = 'Numbers')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

### Missing Data

* Create a dictionary with missing values (np.nan)
* Create dataframe using dictionary
* Drop NAN with or without threshold
* Fill NAN with desired value

In [46]:
# create a dictionary with missing values (np.nan)
d = {'A' : [1, 2, np.nan], 'B' : [5, np.nan, np.nan], 'C' : [1, 2, 3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [47]:
# create dataframe using dictionary
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [48]:
# drop missing values
df.dropna() # drops rows with at least one nan - by default axis = 0

     A    B  C
0  1.0  5.0  1

In [49]:
# drop columns with nan
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [50]:
# drop with threshold
df.dropna(thresh = 2) # drop rows that do not have at least 2 non-nan values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [51]:
# fill nan with desired value
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [52]:
# fill nan in a particular column
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby

* It allows us to group rows together based on a column and perform an aggregate function on them
* After grouping we can call aggregate functions such as mean(), sum(), std(), max(), min(), count() etc
* Function 'describe' on DataFrameGroupBy object gives a bunch of information

In [53]:
# create a dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [54]:
# group by company name
by_company = df.groupby('Company') # this is DataFrameGroupBy object. We can call aggregate functions on this object
by_company

In [55]:
# aggregate function mean(), sum(), std(), max(), min(), count() etc
by_company.mean() # gets mean sales for each company. It ignores 'Person' column because it's string

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [56]:
# get sum of sales of MSFT
df.groupby('Company').sum().loc['MSFT']

Sales    464
Name: MSFT, dtype: int64

In [57]:
# describe function
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

### Concatenation

* Glues together DataFrames. Dimensions should match along the axis

In [58]:
# create dataframes
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [59]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [60]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [61]:
# concatenation on rows
pd.concat([df1, df2, df3]).transpose()

   0   1   2   3   4   5   6   7   8   9    10   11
A  A0  A1  A2  A3  A4  A5  A6  A7  A8  A9  A10  A11
B  B0  B1  B2  B3  B4  B5  B6  B7  B8  B9  B10  B11
C  C0  C1  C2  C3  C4  C5  C6  C7  C8  C9  C10  C11
D  D0  D1  D2  D3  D4  D5  D6  D7  D8  D9  D10  D11

In [62]:
# concatenation on columns
pd.concat([df1, df2, df3], axis = 1) # a bunch of missing values

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging
 
* Merges dataframes together. This is similar to SQL joins
* Inner: Only common elements in both the dataframes based on given columns
* Left: All elements in left and common elements in both dataframes based on given columns
* Right: All elements in right and common elements in both dataframes based on given columns
* Outer: All elements in both dataframes based on given columns

In [63]:
# create 2 dataframes
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [64]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [65]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [66]:
# inner join on key1 and key2 - only common elements (key1 and key2) in both dataframes
pd.merge(left, right, how='inner', on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [67]:
# left join on key1 and key2 - all elements in left and common elements in both dataframes
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [68]:
# right join on key1 and key2 - all elements in right and common elements in both dataframes
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [69]:
# outer join on key1 and key2 - all elements in both dataframes
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

### Joining

* It is a method for combining columns of two differently-indexed dataframes
* It's similar to merge but here we'll be combining based on index

In [70]:
# create dataframes with different index
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [71]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [72]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [73]:
# left join
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [74]:
# right join
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [75]:
# inner join
right.join(left, how='inner')

     C   D   A   B
K0  C0  D0  A0  B0
K2  C2  D2  A2  B2

In [76]:
# outer join
right.join(left, how='outer')

      C    D    A    B
K0   C0   D0   A0   B0
K1  NaN  NaN   A1   B1
K2   C2   D2   A2   B2
K3   C3   D3  NaN  NaN

### Operations

* Get unique elements in a dataframe
* Get unique elements count
* Apply our custom functions to dataframe
* Sort dataframes by column
* Store dataframe as a multiindex table using pivot_table function

In [77]:
# create dataframe
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [78]:
# returns first n rows
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [79]:
# unique elements
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [80]:
# number of unique elements
df['col2'].nunique() # OR len(df['col2'].unique())

3

In [81]:
# to know how many times a value has occured in the dataframe
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [82]:
# to apply our custom functions to dataframe
def times2(num):
    return num * 2

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [83]:
# using lambda function
df['col1'].apply(lambda num : num * 2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [84]:
# using apply function we can also pass built-in functions
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [85]:
# sort by column
df.sort_values('col2') # by default ascending

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [86]:
# check any null values
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [87]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [88]:
# to store dataframe as a multi-index table
df.pivot_table(values = 'D', index = ['A', 'B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Data Input and Output

* CSV
* Excel
* HTML
* SQL

In [89]:
# read from csv file
df = pd.read_csv('data/example_csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [91]:
# write dataframe to csv file when index = True (by default)
df.to_csv('data/output_csv') # if index = True then index of dataframe will be saved as a new unnamed column
pd.read_csv('data/output_csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [92]:
# write dataframe to csv file with index = False (do not consider index or ignore index of the datafram)
df.to_csv('data/output_csv', index = False) 
pd.read_csv('data/output_csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [99]:
# read from excel file
df = pd.read_excel('data/example_excel.xlsx', sheet_name = 'Sheet1')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [102]:
# write to excel file
df.to_excel('data/output_excel.xlsx', sheet_name = 'Sheet2', index = False)
pd.read_excel('data/output_excel.xlsx', sheet_name = 'Sheet2')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [106]:
# read html
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/banklist.html')
type(data) # a list that contains a dataframe

list

In [123]:
df = data[0]
df

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [124]:
df['City']

0      Barboursville
1            Ericson
2             Newark
3             Maumee
4             Louisa
           ...
556         Hinsdale
557            Malta
558       Manchester
559       Metropolis
560         Honolulu
Name: City, Length: 561, dtype: object

In [126]:
df.loc[1]['Bank Name']

'Ericson State Bank'

In [130]:
# to read sql first create sql engine in memory
from sqlalchemy import create_engine
sql_engine = create_engine('sqlite:///:memory:')

# take original df
df = pd.read_csv('data/example_csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [134]:
# populate data to sql table
df.to_sql('my_table', sql_engine) # we can run this only once because we get table already exist error
sqldf = pd.read_sql('my_table', con = sql_engine) # sql_engine is the connection to sql
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15